Dlubal.RFEM5.CrossSection
Cross-section parameters

Dlubal.RFEM5.CrossSection.No
Number

Dlubal.RFEM5.CrossSection.ID
Identifier

Dlubal.RFEM5.CrossSection.Comment
Comment

Dlubal.RFEM5.CrossSection.Tag
Tag

Dlubal.RFEM5.CrossSection.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.CrossSection.Description
Description

Dlubal.RFEM5.CrossSection.TextID
Language independent text identifier

Dlubal.RFEM5.CrossSection.UserDefined
User defined cross-section (read only)

Dlubal.RFEM5.CrossSection.MaterialNo
Material No.

Dlubal.RFEM5.CrossSection.Rotation
Rotation about x-axis - angle α'

Dlubal.RFEM5.CrossSection.Angle
Inclination of principal axes - angle α (read only)

Dlubal.RFEM5.CrossSection.TorsionMoment
Torsion moment of inertia J

Dlubal.RFEM5.CrossSection.BendingMomentY
Bending moment of inertia Iy

Dlubal.RFEM5.CrossSection.BendingMomentZ
Bending moment of inertia Iz

Dlubal.RFEM5.CrossSection.AxialArea
Axial area A

Dlubal.RFEM5.CrossSection.ShearAreaY
Shear Ay

Dlubal.RFEM5.CrossSection.ShearAreaZ
Shear Az

Dlubal.RFEM5.CrossSection.TemperatureLoadWidth
Overall width for non-uniform temperature loads

Dlubal.RFEM5.CrossSection.TemperatureLoadDepth
Overall depth for non-uniform temperature loads